DataFrames

In [2]:
#combine multiple series = dataframe
import numpy as np
import pandas as pd

In [3]:
#creating a dataframe

data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [4]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [7]:
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns =columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:
#selection and indexing of columns

df2['Name']  #single column selection

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [14]:
df2[['Name','Age']]  #multiple column selection

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [23]:
#create a new coloumn
#df2['Experience'] = [5,7,3,10]
df2['Designation'] = ["Manager","Developer","Analyst","Consultant"]
df2

    Name  Age      City  Salary  Experience Designation
0   John   28  New York   65000           5     Manager
1   Anna   34     Paris   70000           7   Developer
2  Peter   29    Berlin   62000           4     Analyst
3  Linda   42    London   85000          10  Consultant

In [24]:
#removing a column
df2.drop('Designation',axis=1)
df2

    Name  Age      City  Salary  Experience Designation
0   John   28  New York   65000           5     Manager
1   Anna   34     Paris   70000           7   Developer
2  Peter   29    Berlin   62000           4     Analyst
3  Linda   42    London   85000          10  Consultant

In [25]:
#removing a column
df2.drop('Designation',axis=1,inplace=True)
df2

    Name  Age      City  Salary  Experience
0   John   28  New York   65000           5
1   Anna   34     Paris   70000           7
2  Peter   29    Berlin   62000           4
3  Linda   42    London   85000          10

In [26]:
df2.drop(["City","Salary"],axis=1)
df2

    Name  Age      City  Salary  Experience
0   John   28  New York   65000           5
1   Anna   34     Paris   70000           7
2  Peter   29    Berlin   62000           4
3  Linda   42    London   85000          10

In [29]:
df2.drop(0,axis=0,inplace=True)
df2

    Name  Age    City  Salary  Experience
1   Anna   34   Paris   70000           7
2  Peter   29  Berlin   62000           4
3  Linda   42  London   85000          10

Rows

In [31]:
df2

    Name  Age    City  Salary  Experience
1   Anna   34   Paris   70000           7
2  Peter   29  Berlin   62000           4
3  Linda   42  London   85000          10

In [30]:
#selecting a row

df2.loc[1]  #label based indexing

Name           Anna
Age              34
City          Paris
Salary        70000
Experience        7
Name: 1, dtype: object

In [34]:
df2.loc[[1,2]]

    Name  Age    City  Salary  Experience
1   Anna   34   Paris   70000           7
2  Peter   29  Berlin   62000           4

In [35]:
df2.iloc[1]  #position based indexing

Name           Peter
Age               29
City          Berlin
Salary         62000
Experience         4
Name: 2, dtype: object

In [42]:
df2.loc[[1,2],['City','Salary']] #[[rows],[columns]]

     City  Salary
1   Paris   70000
2  Berlin   62000

In [43]:
#conditional selection
df2[df2['Age']>30]

    Name  Age    City  Salary  Experience
1   Anna   34   Paris   70000           7
3  Linda   42  London   85000          10

In [44]:
df2[df2['City']=='Berlin']

    Name  Age    City  Salary  Experience
2  Peter   29  Berlin   62000           4

In [45]:
df2[df2['Salary']>=70000]

    Name  Age    City  Salary  Experience
1   Anna   34   Paris   70000           7
3  Linda   42  London   85000          10